# Принцип открытости / закрытости

# Расширяйте классы, но не изменяйте их первоначальный код!
# Нужно стремиться к тому, чтобы классы были открыты для расширения,
# и закрыты для изменения.

# Открытый класс - класс, который доступен для расширения (путем создания подкласса)
# Закрытый (законченный) класс - класс, у которого интерфейс окончательно определен и не будет
# меняться в будущем, то есть он готов для использования другими классами

# Цель - не ломать существующий код при внесении изменений в программу.
